app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY position
---
  def index
    @products = Product.order("position")